Merge pull request #19 from jgador/demo
Add few programming language support using loggle
